test/good/preferred-stdlib-api.dot
digraph "preferred-stdlib-api" {
    node [shape=box];
    subgraph "cluster_Test__receive_internal_simple_1691" {
        label="Test__receive_internal_simple_1691";
        "Test__receive_internal_simple_1691_142" [label="let pkg: Slice = msg.whatever"];
        "Test__receive_internal_simple_1691_143" [label="let _seqno: Int = pkg.loadInt(32)"];
        "Test__receive_internal_simple_1691_145" [label="let mode: Int = pkg.loadInt(8)"];
        "Test__receive_internal_simple_1691_147" [label="let body: Cell = pkg.loadRef()"];
        "Test__receive_internal_simple_1691_149" [label="nativeSendMessage(body, mode)",style=filled,fillcolor="#66A7DB"];
        "Test__receive_internal_simple_1691_142" -> "Test__receive_internal_simple_1691_143";
        "Test__receive_internal_simple_1691_143" -> "Test__receive_internal_simple_1691_145";
        "Test__receive_internal_simple_1691_145" -> "Test__receive_internal_simple_1691_147";
        "Test__receive_internal_simple_1691_147" -> "Test__receive_internal_simple_1691_149";
    }
    subgraph "cluster_Test__getInt" {
        label="Test__getInt";
        "Test__getInt_151" [label="return nativeRandom()",style=filled,fillcolor="#66A7DB"];
    }
}
